betaflight/betaflight/lib/main/CH32H41x/Peripheral/inc/ch32h417_dma.h
/********************************** (C) COPYRIGHT  *******************************
* File Name          : ch32h417_dma.h
* Author             : WCH
* Version            : V1.0.0
* Date               : 2025/03/01
* Description        : This file contains all the functions prototypes for the 
*                      DMA firmware library.
*********************************************************************************
* Copyright (c) 2025 Nanjing Qinheng Microelectronics Co., Ltd.
* Attention: This software (modified or not) and binary are used for 
* microcontroller manufactured by Nanjing Qinheng Microelectronics.
*******************************************************************************/ 
#ifndef __CH32H417_DMA_H
#define __CH32H417_DMA_H

#ifdef __cplusplus
 extern "C" {
#endif

#include "ch32h417.h"
 
typedef enum
{
  DMAMUX_DMAREQ_ID_TIM1_CH1                = 1, /*!< dmamux channel dma request inputs resources: generator channel1 */
  DMAMUX_DMAREQ_ID_TIM1_CH2                = 2, /*!< dmamux channel dma request inputs resources: generator channel2 */
  DMAMUX_DMAREQ_ID_TIM1_CH3                = 3, /*!< dmamux channel dma request inputs resources: generator channel3 */
  DMAMUX_DMAREQ_ID_TIM1_CH4                = 4, /*!< dmamux channel dma request inputs resources: generator channel4 */
  DMAMUX_DMAREQ_ID_TIM1_UP                 = 5, /*!< dmamux channel dma request inputs resources: adc1 */
  DMAMUX_DMAREQ_ID_TIM1_COM                = 6, /*!< dmamux channel dma request inputs resources: adc2 */
  DMAMUX_DMAREQ_ID_TIM1_TRIG               = 7, /*!< dmamux channel dma request inputs resources: adc3 */
  DMAMUX_DMAREQ_ID_TIM2_CH1                = 8, /*!< dmamux channel dma request inputs resources: dac1 */
  DMAMUX_DMAREQ_ID_TIM2_CH2                = 9, /*!< dmamux channel dma request inputs resources: dac2 */
  DMAMUX_DMAREQ_ID_TIM2_CH3                = 10, /*!< dmamux channel dma request inputs resources: timer6 overflow */
  DMAMUX_DMAREQ_ID_TIM2_CH4                = 11, /*!< dmamux channel dma request inputs resources: timer7 overflow */
  DMAMUX_DMAREQ_ID_TIM2_UP                 = 12, /*!< dmamux channel dma request inputs resources: spi1 rx */
  DMAMUX_DMAREQ_ID_TIM2_TRIG               = 13, /*!< dmamux channel dma request inputs resources: spi1 tx */
  DMAMUX_DMAREQ_ID_TIM3_CH1                = 14, /*!< dmamux channel dma request inputs resources: dac1 */
  DMAMUX_DMAREQ_ID_TIM3_CH2                = 15, /*!< dmamux channel dma request inputs resources: dac2 */
  DMAMUX_DMAREQ_ID_TIM3_CH3                = 16, /*!< dmamux channel dma request inputs resources: timer6 overflow */
  DMAMUX_DMAREQ_ID_TIM3_CH4                = 17, /*!< dmamux channel dma request inputs resources: timer7 overflow */
  DMAMUX_DMAREQ_ID_TIM3_UP                 = 18, /*!< dmamux channel dma request inputs resources: spi1 rx */
  DMAMUX_DMAREQ_ID_TIM3_TRIG               = 19, /*!< dmamux channel dma request inputs resources: spi1 tx */
 
  DMAMUX_DMAREQ_ID_TIM4_CH1                = 20, /*!< dmamux channel dma request inputs resources: dac1 */
  DMAMUX_DMAREQ_ID_TIM4_CH2                = 21, /*!< dmamux channel dma request inputs resources: dac2 */
  DMAMUX_DMAREQ_ID_TIM4_CH3                = 22, /*!< dmamux channel dma request inputs resources: timer6 overflow */
  DMAMUX_DMAREQ_ID_TIM4_CH4                = 23, /*!< dmamux channel dma request inputs resources: timer7 overflow */
  DMAMUX_DMAREQ_ID_TIM4_UP                 = 24, /*!< dmamux channel dma request inputs resources: spi1 rx */
  DMAMUX_DMAREQ_ID_TIM4_TRIG               = 25, /*!< dmamux channel dma request inputs resources: spi1 tx */
 
  DMAMUX_DMAREQ_ID_TIM5_CH1                = 26, /*!< dmamux channel dma request inputs resources: dac1 */
  DMAMUX_DMAREQ_ID_TIM5_CH2                = 27, /*!< dmamux channel dma request inputs resources: dac2 */
  DMAMUX_DMAREQ_ID_TIM5_CH3                = 28, /*!< dmamux channel dma request inputs resources: timer6 overflow */
  DMAMUX_DMAREQ_ID_TIM5_CH4                = 29, /*!< dmamux channel dma request inputs resources: timer7 overflow */
  DMAMUX_DMAREQ_ID_TIM5_UP                 = 30, /*!< dmamux channel dma request inputs resources: spi1 rx */
  DMAMUX_DMAREQ_ID_TIM5_TRIG               = 31, /*!< dmamux channel dma request inputs resources: spi1 tx */
  
  DMAMUX_DMAREQ_ID_TIM8_CH1                = 32, /*!< dmamux channel dma request inputs resources: generator channel1 */
  DMAMUX_DMAREQ_ID_TIM8_CH2                = 33, /*!< dmamux channel dma request inputs resources: generator channel2 */
  DMAMUX_DMAREQ_ID_TIM8_CH3                = 34, /*!< dmamux channel dma request inputs resources: generator channel3 */
  DMAMUX_DMAREQ_ID_TIM8_CH4                = 35, /*!< dmamux channel dma request inputs resources: generator channel4 */
  DMAMUX_DMAREQ_ID_TIM8_UP                 = 36, /*!< dmamux channel dma request inputs resources: adc1 */
  DMAMUX_DMAREQ_ID_TIM8_COM                = 37, /*!< dmamux channel dma request inputs resources: adc2 */
  DMAMUX_DMAREQ_ID_TIM8_TRIG               = 38, /*!< dmamux channel dma request inputs resources: adc3 */

  DMAMUX_DMAREQ_ID_TIM9_CH1                = 39, /*!< dmamux channel dma request inputs resources: dac1 */
  DMAMUX_DMAREQ_ID_TIM9_CH2                = 40, /*!< dmamux channel dma request inputs resources: dac2 */
  DMAMUX_DMAREQ_ID_TIM9_CH3                = 41, /*!< dmamux channel dma request inputs resources: timer6 overflow */
  DMAMUX_DMAREQ_ID_TIM9_CH4                = 42, /*!< dmamux channel dma request inputs resources: timer7 overflow */
  DMAMUX_DMAREQ_ID_TIM9_UP                 = 43, /*!< dmamux channel dma request inputs resources: spi1 rx */
  DMAMUX_DMAREQ_ID_TIM9_TRIG               = 44, /*!< dmamux channel dma request inputs resources: spi1 tx */
 
  DMAMUX_DMAREQ_ID_TIM10_CH1               = 45, /*!< dmamux channel dma request inputs resources: dac1 */
  DMAMUX_DMAREQ_ID_TIM10_CH2               = 46, /*!< dmamux channel dma request inputs resources: dac2 */
  DMAMUX_DMAREQ_ID_TIM10_CH3               = 47, /*!< dmamux channel dma request inputs resources: timer6 overflow */
  DMAMUX_DMAREQ_ID_TIM10_CH4               = 48, /*!< dmamux channel dma request inputs resources: timer7 overflow */
  DMAMUX_DMAREQ_ID_TIM10_UP                = 49, /*!< dmamux channel dma request inputs resources: spi1 rx */
  DMAMUX_DMAREQ_ID_TIM10_TRIG              = 50, /*!< dmamux channel dma request inputs resources: spi1 tx */

  DMAMUX_DMAREQ_ID_TIM11_CH1               = 51, /*!< dmamux channel dma request inputs resources: dac1 */
  DMAMUX_DMAREQ_ID_TIM11_CH2               = 52, /*!< dmamux channel dma request inputs resources: dac2 */
  DMAMUX_DMAREQ_ID_TIM11_CH3               = 53, /*!< dmamux channel dma request inputs resources: timer6 overflow */
  DMAMUX_DMAREQ_ID_TIM11_CH4               = 54, /*!< dmamux channel dma request inputs resources: timer7 overflow */
  DMAMUX_DMAREQ_ID_TIM11_UP                = 55, /*!< dmamux channel dma request inputs resources: spi1 rx */
  DMAMUX_DMAREQ_ID_TIM11_TRIG              = 56, /*!< dmamux channel dma request inputs resources: spi1 tx */

  DMAMUX_DMAREQ_ID_TIM12_CH1               = 57, /*!< dmamux channel dma request inputs resources: dac1 */
  DMAMUX_DMAREQ_ID_TIM12_CH2               = 58, /*!< dmamux channel dma request inputs resources: dac2 */
  DMAMUX_DMAREQ_ID_TIM12_CH3               = 59, /*!< dmamux channel dma request inputs resources: timer6 overflow */
  DMAMUX_DMAREQ_ID_TIM12_CH4               = 60, /*!< dmamux channel dma request inputs resources: timer7 overflow */
  DMAMUX_DMAREQ_ID_TIM12_UP                = 61, /*!< dmamux channel dma request inputs resources: spi1 rx */
  DMAMUX_DMAREQ_ID_TIM12_TRIG              = 62, /*!< dmamux channel dma request inputs resources: spi1 tx */
  
