betaflight/betaflight/lib/main/CH32H41x/Peripheral/inc/ch32h417_dma.h
  DMAMUX_DMAREQ_ID_SPI1_TX                 = 63,
  DMAMUX_DMAREQ_ID_SPI1_RX                 = 64,
  DMAMUX_DMAREQ_ID_SPI2_TX                 = 65,
  DMAMUX_DMAREQ_ID_SPI2_RX                 = 66,
  DMAMUX_DMAREQ_ID_SPI3_TX                 = 67,
  DMAMUX_DMAREQ_ID_SPI3_RX                 = 68,
  DMAMUX_DMAREQ_ID_SPI4_TX                 = 69,
  DMAMUX_DMAREQ_ID_SPI4_RX                 = 70,
  DMAMUX_DMAREQ_ID_QSPI1                   = 71,
  DMAMUX_DMAREQ_ID_QSPI2                   = 72,

  DMAMUX_DMAREQ_ID_I2C1_TX                 = 73,
  DMAMUX_DMAREQ_ID_I2C1_RX                 = 74,
  DMAMUX_DMAREQ_ID_I2C2_TX                 = 75,
  DMAMUX_DMAREQ_ID_I2C2_RX                 = 76,  
  DMAMUX_DMAREQ_ID_I2C3_TX                 = 77,
  DMAMUX_DMAREQ_ID_I2C3_RX                 = 78,
  DMAMUX_DMAREQ_ID_I2C4_TX                 = 79,
  DMAMUX_DMAREQ_ID_I2C4_RX                 = 80,

  DMAMUX_DMAREQ_ID_I3C_RS                  = 81,
  DMAMUX_DMAREQ_ID_I3C_TC                  = 82,
  DMAMUX_DMAREQ_ID_I3C_TX                  = 83,
  DMAMUX_DMAREQ_ID_I3C_RX                  = 84,
  
  DMAMUX_DMAREQ_ID_USART1_TX               = 85,
  DMAMUX_DMAREQ_ID_USART1_RX               = 86,  
  DMAMUX_DMAREQ_ID_USART2_TX               = 87,
  DMAMUX_DMAREQ_ID_USART2_RX               = 88,
  DMAMUX_DMAREQ_ID_USART3_TX               = 89,
  DMAMUX_DMAREQ_ID_USART3_RX               = 90,
  DMAMUX_DMAREQ_ID_USART4_TX               = 91,
  DMAMUX_DMAREQ_ID_USART4_RX               = 92,
  DMAMUX_DMAREQ_ID_USART5_TX               = 93,
  DMAMUX_DMAREQ_ID_USART5_RX               = 94,
  DMAMUX_DMAREQ_ID_USART6_TX               = 95,
  DMAMUX_DMAREQ_ID_USART6_RX               = 96,
  DMAMUX_DMAREQ_ID_USART7_TX               = 97,
  DMAMUX_DMAREQ_ID_USART7_RX               = 98,
  DMAMUX_DMAREQ_ID_USART8_TX               = 99,
  DMAMUX_DMAREQ_ID_USART8_RX               = 100,  

  DMAMUX_DMAREQ_ID_SPWMI_TX                = 101,
  DMAMUX_DMAREQ_ID_SPWMI_RX                = 102, 
  
  DMAMUX_DMAREQ_ID_DAC1                    = 103,
  DMAMUX_DMAREQ_ID_DAC2                    = 104, 

  DMAMUX_DMAREQ_ID_REV1                    = 105,
  DMAMUX_DMAREQ_ID_REV2                    = 106, 

  DMAMUX_DMAREQ_ID_DFSDM_DMA0              = 107,
  DMAMUX_DMAREQ_ID_DFSDM_DMA1              = 108, 

  DMAMUX_DMAREQ_ID_REV3                    = 109,
  DMAMUX_DMAREQ_ID_REV4                    = 110,  
  
  DMAMUX_DMAREQ_ID_SDIO                    = 111,    
  
  DMAMUX_DMAREQ_ID_SAIA_TX                 = 112,
  DMAMUX_DMAREQ_ID_SAIA_RX                 = 113, 
  DMAMUX_DMAREQ_ID_SAIB_TX                 = 114,
  DMAMUX_DMAREQ_ID_SAIB_RX                 = 115, 

  DMAMUX_DMAREQ_ID_REV5                    = 116,
  DMAMUX_DMAREQ_ID_REV6                    = 117,  
  DMAMUX_DMAREQ_ID_REV7                    = 118,
  DMAMUX_DMAREQ_ID_REV8                    = 119,   
  
  DMAMUX_DMAREQ_ID_ADC1                    = 120,
  DMAMUX_DMAREQ_ID_ADC2                    = 121,   

  DMAMUX_DMAREQ_ID_TIM6_UP                 = 122,
  DMAMUX_DMAREQ_ID_TIM7_UP                 = 123 
} dmamux_requst_id_sel_type;



/* DMA Init structure definition */
typedef struct
{
  uint32_t DMA_PeripheralBaseAddr; /* Specifies the peripheral base address for DMAy Channelx. */

  uint32_t DMA_Memory0BaseAddr;     /* Specifies the memory0 base address for DMAy Channelx. */

  uint32_t DMA_DIR;                /* Specifies if the peripheral is the source or destination.
                                      This parameter can be a value of @ref DMA_data_transfer_direction */

  uint32_t DMA_BufferSize;         /* Specifies the buffer size, in data unit, of the specified Channel. 
                                      The data unit is equal to the configuration set in DMA_PeripheralDataSize
                                      or DMA_MemoryDataSize members depending in the transfer direction. */

  uint32_t DMA_PeripheralInc;      /* Specifies whether the Peripheral address register is incremented or not.
                                      This parameter can be a value of @ref DMA_peripheral_incremented_mode */

  uint32_t DMA_MemoryInc;          /* Specifies whether the memory address register is incremented or not.
                                      This parameter can be a value of @ref DMA_memory_incremented_mode */

  uint32_t DMA_PeripheralDataSize; /* Specifies the Peripheral data width.
                                      This parameter can be a value of @ref DMA_peripheral_data_size */

  uint32_t DMA_MemoryDataSize;     /* Specifies the Memory data width.
                                      This parameter can be a value of @ref DMA_memory_data_size */

  uint32_t DMA_Mode;               /* Specifies the operation mode of the DMAy Channelx.
                                      This parameter can be a value of @ref DMA_circular_normal_mode.
                                      @note: The circular buffer mode cannot be used if the memory-to-memory
                                            data transfer is configured on the selected Channel */

  uint32_t DMA_Priority;           /* Specifies the software priority for the DMAy Channelx.
                                      This parameter can be a value of @ref DMA_priority_level */

  uint32_t DMA_M2M;                /* Specifies if the DMAy Channelx will be used in memory-to-memory transfer.
                                      This parameter can be a value of @ref DMA_memory_to_memory */

  uint32_t DMA_BufferMode;         /* Specifies if the DMAy Channelx will be used in buffer mode.
                                      This parameter can be a value of @ref DMA_BufferMode_Memory */

  uint32_t DMA_Memory1BaseAddr;     /* Specifies the memory1 base address for DMAy Channelx. */

  uint32_t DMA_DoubleBuffer_StartMemory;  /* Specifies if the DMAy Channelx will be used in double buffer start memory.
                                      This parameter can be a value of @ref DMA_DoubleBufferMode_Memory */

}DMA_InitTypeDef;




/* DMA_data_transfer_direction */
#define DMA_DIR_PeripheralDST              ((uint32_t)0x00000010)
#define DMA_DIR_PeripheralSRC              ((uint32_t)0x00000000)

/* DMA_peripheral_incremented_mode */
#define DMA_PeripheralInc_Enable           ((uint32_t)0x00000040)
#define DMA_PeripheralInc_Disable          ((uint32_t)0x00000000)
											
/* DMA_memory_incremented_mode */
#define DMA_MemoryInc_Enable               ((uint32_t)0x00000080)
#define DMA_MemoryInc_Disable              ((uint32_t)0x00000000)
										
/* DMA_peripheral_data_size */
#define DMA_PeripheralDataSize_Byte        ((uint32_t)0x00000000)
#define DMA_PeripheralDataSize_HalfWord    ((uint32_t)0x00000100)
#define DMA_PeripheralDataSize_Word        ((uint32_t)0x00000200)

/* DMA_memory_data_size */
#define DMA_MemoryDataSize_Byte            ((uint32_t)0x00000000)
#define DMA_MemoryDataSize_HalfWord        ((uint32_t)0x00000400)
#define DMA_MemoryDataSize_Word            ((uint32_t)0x00000800)

