betaflight/betaflight/lib/main/CH32H41x/Peripheral/inc/ch32h417_dma.h
/* DMA_circular_normal_mode */
#define DMA_Mode_Circular                  ((uint32_t)0x00000020)
#define DMA_Mode_Normal                    ((uint32_t)0x00000000)

/* DMA_priority_level */
#define DMA_Priority_VeryHigh              ((uint32_t)0x00003000)
#define DMA_Priority_High                  ((uint32_t)0x00002000)
#define DMA_Priority_Medium                ((uint32_t)0x00001000)
#define DMA_Priority_Low                   ((uint32_t)0x00000000)

/* DMA_memory_to_memory */
#define DMA_M2M_Enable                     ((uint32_t)0x00004000)
#define DMA_M2M_Disable                    ((uint32_t)0x00000000)

/* DMA_interrupts_definition */
#define DMA_IT_TC                          ((uint32_t)0x00000002)
#define DMA_IT_HT                          ((uint32_t)0x00000004)
#define DMA_IT_TE                          ((uint32_t)0x00000008)

#define DMA1_IT_GL1                        ((uint32_t)0x00000001)
#define DMA1_IT_TC1                        ((uint32_t)0x00000002)
#define DMA1_IT_HT1                        ((uint32_t)0x00000004)
#define DMA1_IT_TE1                        ((uint32_t)0x00000008)
#define DMA1_IT_GL2                        ((uint32_t)0x00000010)
#define DMA1_IT_TC2                        ((uint32_t)0x00000020)
#define DMA1_IT_HT2                        ((uint32_t)0x00000040)
#define DMA1_IT_TE2                        ((uint32_t)0x00000080)
#define DMA1_IT_GL3                        ((uint32_t)0x00000100)
#define DMA1_IT_TC3                        ((uint32_t)0x00000200)
#define DMA1_IT_HT3                        ((uint32_t)0x00000400)
#define DMA1_IT_TE3                        ((uint32_t)0x00000800)
#define DMA1_IT_GL4                        ((uint32_t)0x00001000)
#define DMA1_IT_TC4                        ((uint32_t)0x00002000)
#define DMA1_IT_HT4                        ((uint32_t)0x00004000)
#define DMA1_IT_TE4                        ((uint32_t)0x00008000)
#define DMA1_IT_GL5                        ((uint32_t)0x00010000)
#define DMA1_IT_TC5                        ((uint32_t)0x00020000)
#define DMA1_IT_HT5                        ((uint32_t)0x00040000)
#define DMA1_IT_TE5                        ((uint32_t)0x00080000)
#define DMA1_IT_GL6                        ((uint32_t)0x00100000)
#define DMA1_IT_TC6                        ((uint32_t)0x00200000)
#define DMA1_IT_HT6                        ((uint32_t)0x00400000)
#define DMA1_IT_TE6                        ((uint32_t)0x00800000)
#define DMA1_IT_GL7                        ((uint32_t)0x01000000)
#define DMA1_IT_TC7                        ((uint32_t)0x02000000)
#define DMA1_IT_HT7                        ((uint32_t)0x04000000)
#define DMA1_IT_TE7                        ((uint32_t)0x08000000)
#define DMA1_IT_GL8                        ((uint32_t)0x10000000)
#define DMA1_IT_TC8                        ((uint32_t)0x20000000)
#define DMA1_IT_HT8                        ((uint32_t)0x40000000)
#define DMA1_IT_TE8                        ((uint32_t)0x80000000)

#define DMA2_IT_GL1                        ((uint32_t)0x00000001)
#define DMA2_IT_TC1                        ((uint32_t)0x00000002)
#define DMA2_IT_HT1                        ((uint32_t)0x00000004)
#define DMA2_IT_TE1                        ((uint32_t)0x00000008)
#define DMA2_IT_GL2                        ((uint32_t)0x00000010)
#define DMA2_IT_TC2                        ((uint32_t)0x00000020)
#define DMA2_IT_HT2                        ((uint32_t)0x00000040)
#define DMA2_IT_TE2                        ((uint32_t)0x00000080)
#define DMA2_IT_GL3                        ((uint32_t)0x00000100)
#define DMA2_IT_TC3                        ((uint32_t)0x00000200)
#define DMA2_IT_HT3                        ((uint32_t)0x00000400)
#define DMA2_IT_TE3                        ((uint32_t)0x00000800)
#define DMA2_IT_GL4                        ((uint32_t)0x00001000)
#define DMA2_IT_TC4                        ((uint32_t)0x00002000)
#define DMA2_IT_HT4                        ((uint32_t)0x00004000)
#define DMA2_IT_TE4                        ((uint32_t)0x00008000)
#define DMA2_IT_GL5                        ((uint32_t)0x00010000)
#define DMA2_IT_TC5                        ((uint32_t)0x00020000)
#define DMA2_IT_HT5                        ((uint32_t)0x00040000)
#define DMA2_IT_TE5                        ((uint32_t)0x00080000)
#define DMA2_IT_GL6                        ((uint32_t)0x00100000)
#define DMA2_IT_TC6                        ((uint32_t)0x00200000)
#define DMA2_IT_HT6                        ((uint32_t)0x00400000)
#define DMA2_IT_TE6                        ((uint32_t)0x00800000)
#define DMA2_IT_GL7                        ((uint32_t)0x01000000)
#define DMA2_IT_TC7                        ((uint32_t)0x02000000)
#define DMA2_IT_HT7                        ((uint32_t)0x04000000)
#define DMA2_IT_TE7                        ((uint32_t)0x08000000)
#define DMA2_IT_GL8                        ((uint32_t)0x10000000)
#define DMA2_IT_TC8                        ((uint32_t)0x20000000)
#define DMA2_IT_HT8                        ((uint32_t)0x40000000)
#define DMA2_IT_TE8                        ((uint32_t)0x80000000)

/* DMA_flags_definition */
#define DMA1_FLAG_GL1                      ((uint32_t)0x00000001)
#define DMA1_FLAG_TC1                      ((uint32_t)0x00000002)
#define DMA1_FLAG_HT1                      ((uint32_t)0x00000004)
#define DMA1_FLAG_TE1                      ((uint32_t)0x00000008)
#define DMA1_FLAG_GL2                      ((uint32_t)0x00000010)
#define DMA1_FLAG_TC2                      ((uint32_t)0x00000020)
#define DMA1_FLAG_HT2                      ((uint32_t)0x00000040)
#define DMA1_FLAG_TE2                      ((uint32_t)0x00000080)
#define DMA1_FLAG_GL3                      ((uint32_t)0x00000100)
#define DMA1_FLAG_TC3                      ((uint32_t)0x00000200)
#define DMA1_FLAG_HT3                      ((uint32_t)0x00000400)
#define DMA1_FLAG_TE3                      ((uint32_t)0x00000800)
#define DMA1_FLAG_GL4                      ((uint32_t)0x00001000)
#define DMA1_FLAG_TC4                      ((uint32_t)0x00002000)
#define DMA1_FLAG_HT4                      ((uint32_t)0x00004000)
#define DMA1_FLAG_TE4                      ((uint32_t)0x00008000)
#define DMA1_FLAG_GL5                      ((uint32_t)0x00010000)
#define DMA1_FLAG_TC5                      ((uint32_t)0x00020000)
#define DMA1_FLAG_HT5                      ((uint32_t)0x00040000)
#define DMA1_FLAG_TE5                      ((uint32_t)0x00080000)
#define DMA1_FLAG_GL6                      ((uint32_t)0x00100000)
#define DMA1_FLAG_TC6                      ((uint32_t)0x00200000)
#define DMA1_FLAG_HT6                      ((uint32_t)0x00400000)
#define DMA1_FLAG_TE6                      ((uint32_t)0x00800000)
#define DMA1_FLAG_GL7                      ((uint32_t)0x01000000)
#define DMA1_FLAG_TC7                      ((uint32_t)0x02000000)
#define DMA1_FLAG_HT7                      ((uint32_t)0x04000000)
#define DMA1_FLAG_TE7                      ((uint32_t)0x08000000)
#define DMA1_FLAG_GL8                      ((uint32_t)0x10000000)
#define DMA1_FLAG_TC8                      ((uint32_t)0x20000000)
#define DMA1_FLAG_HT8                      ((uint32_t)0x40000000)
#define DMA1_FLAG_TE8                      ((uint32_t)0x80000000)

#define DMA2_FLAG_GL1                      ((uint32_t)0x00000001)
#define DMA2_FLAG_TC1                      ((uint32_t)0x00000002)
#define DMA2_FLAG_HT1                      ((uint32_t)0x00000004)
#define DMA2_FLAG_TE1                      ((uint32_t)0x00000008)
#define DMA2_FLAG_GL2                      ((uint32_t)0x00000010)
#define DMA2_FLAG_TC2                      ((uint32_t)0x00000020)
#define DMA2_FLAG_HT2                      ((uint32_t)0x00000040)
#define DMA2_FLAG_TE2                      ((uint32_t)0x00000080)
#define DMA2_FLAG_GL3                      ((uint32_t)0x00000100)
#define DMA2_FLAG_TC3                      ((uint32_t)0x00000200)
#define DMA2_FLAG_HT3                      ((uint32_t)0x00000400)
#define DMA2_FLAG_TE3                      ((uint32_t)0x00000800)
#define DMA2_FLAG_GL4                      ((uint32_t)0x00001000)
#define DMA2_FLAG_TC4                      ((uint32_t)0x00002000)
#define DMA2_FLAG_HT4                      ((uint32_t)0x00004000)
#define DMA2_FLAG_TE4                      ((uint32_t)0x00008000)
#define DMA2_FLAG_GL5                      ((uint32_t)0x00010000)
#define DMA2_FLAG_TC5                      ((uint32_t)0x00020000)
#define DMA2_FLAG_HT5                      ((uint32_t)0x00040000)
#define DMA2_FLAG_TE5                      ((uint32_t)0x00080000)
#define DMA2_FLAG_GL6                      ((uint32_t)0x00100000)
#define DMA2_FLAG_TC6                      ((uint32_t)0x00200000)
#define DMA2_FLAG_HT6                      ((uint32_t)0x00400000)
#define DMA2_FLAG_TE6                      ((uint32_t)0x00800000)
#define DMA2_FLAG_GL7                      ((uint32_t)0x01000000)
#define DMA2_FLAG_TC7                      ((uint32_t)0x02000000)
#define DMA2_FLAG_HT7                      ((uint32_t)0x04000000)
#define DMA2_FLAG_TE7                      ((uint32_t)0x08000000)
#define DMA2_FLAG_GL8                      ((uint32_t)0x10000000)
#define DMA2_FLAG_TC8                      ((uint32_t)0x20000000)
#define DMA2_FLAG_HT8                      ((uint32_t)0x40000000)
#define DMA2_FLAG_TE8                      ((uint32_t)0x80000000)

/* DMA_MuxChannel_definition */
#define DMA_MuxChannel1                    ((uint8_t)0x00)
#define DMA_MuxChannel2                    ((uint8_t)0x01)
#define DMA_MuxChannel3                    ((uint8_t)0x02)
#define DMA_MuxChannel4                    ((uint8_t)0x03)
#define DMA_MuxChannel5                    ((uint8_t)0x04)
#define DMA_MuxChannel6                    ((uint8_t)0x05)
#define DMA_MuxChannel7                    ((uint8_t)0x06)
#define DMA_MuxChannel8                    ((uint8_t)0x07)
#define DMA_MuxChannel9                    ((uint8_t)0x08)
#define DMA_MuxChannel10                   ((uint8_t)0x09)
#define DMA_MuxChannel11                   ((uint8_t)0x0A)
#define DMA_MuxChannel12                   ((uint8_t)0x0B)
#define DMA_MuxChannel13                   ((uint8_t)0x0C)
#define DMA_MuxChannel14                   ((uint8_t)0x0D)
#define DMA_MuxChannel15                   ((uint8_t)0x0E)
#define DMA_MuxChannel16                   ((uint8_t)0x0F)



/* DMA_BufferMode_Memory */
#define DMA_SingleBufferMode               ((uint32_t)0x00000000)
#define DMA_DoubleBufferMode               ((uint32_t)0x00008000)

/* DMA_DoubleBufferMode_Memory */
#define DMA_DoubleBufferMode_Memory_0      ((uint32_t)0x00000000)
#define DMA_DoubleBufferMode_Memory_1      ((uint32_t)0x00010000)

void DMA_DeInit(DMA_Channel_TypeDef* DMAy_Channelx);
void DMA_Init(DMA_Channel_TypeDef* DMAy_Channelx, DMA_InitTypeDef* DMA_InitStruct);
void DMA_StructInit(DMA_InitTypeDef* DMA_InitStruct);
void DMA_Cmd(DMA_Channel_TypeDef* DMAy_Channelx, FunctionalState NewState);
void DMA_ITConfig(DMA_Channel_TypeDef* DMAy_Channelx, uint32_t DMA_IT, FunctionalState NewState);
void DMA_SetCurrDataCounter(DMA_Channel_TypeDef* DMAy_Channelx, uint16_t DataNumber); 
uint16_t DMA_GetCurrDataCounter(DMA_Channel_TypeDef* DMAy_Channelx);
FlagStatus DMA_GetFlagStatus(DMA_TypeDef* DMAx, uint32_t DMAy_FLAG);
void DMA_ClearFlag(DMA_TypeDef* DMAx, uint32_t DMAy_FLAG);
ITStatus DMA_GetITStatus(DMA_TypeDef* DMAx, uint32_t DMAy_IT);
void DMA_ClearITPendingBit(DMA_TypeDef* DMAx, uint32_t DMAy_IT);
void DMA_MuxChannelConfig(uint8_t DMA_MuxChannelx, uint32_t DMA_Requestx);


#ifdef __cplusplus
}
#endif

#endif 

